papers.tex
% Created 2014-11-06 Thu 05:51
\documentclass[10pt]{article}
%% Text layout
\topmargin 0.0cm
\oddsidemargin 0.5cm
\evensidemargin 0.5cm
\textwidth 16cm 
\textheight 21cm
\bibliographystyle{plos2009}
\makeatletter
\renewcommand{\@biblabel}[1]{\quad#1.}
\makeatother
\pagestyle{myheadings}

\usepackage[labelfont=bf,labelsep=period,justification=raggedright]{caption}
\usepackage[usenames,dvipsnames]{color}
\usepackage{float}
\usepackage{cite}
\usepackage{rotating}
\usepackage{microtype}
\usepackage{lineno}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{setspace}
\date{}
\title{}
\hypersetup{
 pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.3beta)}}
\begin{document}

\begin{flushleft}
{\Large
{\bfseries A Spatio-temporal model of African Animal Trypanosomosis risk in Burkina-Faso}
}\\


%% Insert Author names, affiliations and corresponding author email.
Ahmadou H. Dicko$^{1,2}$, 
Giuliano Cecchi$^{3}$, 
Fonta Williams$^{4}$, 
Sanfo Safietou$^{4}$, 
Adama Sow$^{6}$, 
Lassane Percoma$^{6}$, 
Soumaila Pagabeleguem$^{6}$,
Rapha\"{e}lle M\'{e}tras$^{6}$,
Issa Sidib\'{e}$^{6}$,
Renaud Lancelot$^{5}$,
J\'{e}r\'{e}my Bouyer$^{2,5,\ast}$
\\
\bf{1} D\'{e}partement d'\'{e}conomie, Universit\'{e} Cheikh Anta Diop, Dakar, Senegal
\\
\bf{2} Institut Senegalais de recherche agricole, Dakar, Senegal
\\
\bf{3} Food and agriculture organization of the United Nations, Addis-Abbeba, Ethiopia
\\
\bf{4} West African Science Service Center on Climate Change and adapted land use, Ouagadougou, Burkina Faso
\\
\bf{5} Centre de coop\'{e}ration internationale en recherche agronomique pour le d\'{e}veloppement, Montpellier, France
\\
\bf{6} NA
\\
$\ast$ E-mail: Corresponding author bouyer@cirad.fr
\end{flushleft}


\section*{Abstract}
\label{unnumbered-1}
\section*{Introduction}
\label{unnumbered-2}
\subsection*{Context and Importance of trypanosomoses}
\label{unnumbered-3}
In sub-Saharan Africa, African animal trypanosomoses (AAT) are among the main constraints to the development of cattle farming \cite{itard2003trypanosomoses}.
The habitat and ecological environment of the tsetse flies (genus Glossina) have been modified through demographic and climatic pressures.
Landscape  fragmentation has changed the distribution and densities of the vector, and has also affected the epidemiology of the disease by reducing host, vector and parasite diversities \cite{van2010changing}. 
In Burkina Faso, where the disease is endemic along the Mouhoun River basin, climatic and human factors, such as cattle and agriculture, have damaged the riverine landscapes over the last decades,
leading to a fragmentation of gallery forests \cite{guerrini2008fragmentation}. Only two tsetse species remain, namely Glossina palpalis gambiensis Vanderplank and Glossina tachinoides Westwood (Diptera: Glossinidae); 
and their presence and densities depend on the ecotype of riverine forest and its degree of disturbance \cite{bouyer2005phyto}. Several studies have investigated the impact of fragmentation on tsetse distribution, densities \cite{bouyer2005phyto}, 
population structure and dispersal \cite{bouyer2007population, kone2010population} along the Mouhoun river basin. A longitudinal survey also investigated seasonal dynamics of tsetse and mechanical vectors of trypanosomoses have been investigated in landscapes of various fragmentation levels \cite{kone2010population}. 
Environmental factors, namely temperature and relative humidity, appeared to structure tsetse distribution and densities in an opposite way than those of most species of mechanical vectors. Mean maximal temperature was also found highly correlated to tsetse infectious rate \cite{bouyer2013dynamics}. 
Finally, the cyclical risk of transmission of animal trypanosomoses was mapped during the dry season 2007 using the entomological inoculation index, corresponding to the product of tsetse fly apparent densities by  their infection rate \cite{bouyer2006mapping, guerrini2007mapping}. 
The spatio-temporal modeling of tsetse apparent densities was also achieved in three sites along the Mouhoun river, where the longitudinal monitoring of cattle described below was conducted \cite{sedda2010spatio}. 
However, no spatio-temporal prediction model of the entomological inoculation index is presently available. 
The aim of this paper is to assess the risk of AAT  by developing a spatio-temporal statistical model of the entomological inoculation rate (EIR).  
The final output of this model is thus a spatio-temporal index linked to climatic variables upon which it will be possible to design some future climate risk management mechanisms to control AAT.

\section*{Material and methods}
\label{unnumbered-4}
\subsection*{Entomological data}
\label{unnumbered-5}
In Burkina Faso, tsetse eradication efforts, targeting the Northern part of the Mouhoun river basin 
started in 2008 (\url{http://www.pattec.bf/index1.php}). During this eradication project an entomological sampling
that generated an important amount of entomological data such as tsetse apparent density and their trypanosome infection rates were recorded. 
Data from a recent entomological survey in Northern Ghana with the same type of of information were also used in this analysis \cite{adam2012bovine}.
\subsection*{Parasitological and serological data}
\label{unnumbered-6}
Data on bovine trypanosomosis used in this study originated from a parasitological and serological survey done in the Boucle du Mouhoun region in Burkina Faso.
Approximatively 1000 villages were selected and around 2700 cattle were sampled between 
september 2007 and november 2007. Both serological and parasitological status of each animal were assessed, information on sex, breed, age, livestock management were also recorded.
The study and experimental design is thoroughly described in \cite{sow2013baseline}.

\subsection*{Environmental data}
\label{unnumbered-7}
This study used a rich time series of remote sensing data of high spatial and temporal resolution to assess the spatio-temporal risk of the disease.
Firstly, Moderate-resolution Imaging Spectroradiometer (MODIS) remote sensing products and FAO Rainfall estimate (RFE version) were downloaded, cleaned 
and summarized to derive relevant environmental and climatic covariates. 
The final set of data consists of 11 years of monthly climatic data (NDVI, DLST, NLST, RFE) from January 2003 to December 2013.
This set of raster data at 1km of spatial resolution was used to study the dynamic of the population of tsetse flies and saisonality of their infection rates.
Secondly, to analyze the habitat of the two vectors present in the study area, Worldclim BIOCLIM variables \cite{hijmans2005worldclim}, aggregated bioclimatic variables based on the above remote sensing data (MODIS and RFE) and 
a digital elevation model were also used.
Finally, cattle density layers from \cite{robinsonmapping2014} and data on the main wild hosts from the african mammals databank \cite{union1999databank} were also added to the set of covariates
to analyze the infection rates and population dynamic.  
All the variables were selected and constructed to capture the complexity of the epidemiology of the African Animal Trypanosomosis.
(see Appendix S1 for further details on these data).
