papers.tex

\subsection*{Models}
\label{unnumbered-8}
The goal of the main model is to compute the expected entomological inoculation rate in the study area using climatic and environmental data.
EIR which is also known as tsetse challenge is one of the most widely used and effective risk indicator for tsetse-borne diseases \cite{rogers1985trypanosomiasis}. 
EIR represents the number of infective bites a host received during a given period of time. This indicator is well known and used by malariologists to measure the intensity of the transmission of malaria \cite{smith2005entomological}.  
Some efforts have been made recently to map EIR using similar spatio-temporal entomological data \cite{rumisha2014modelling}. 

It is calculated as the product of tsetse apparent density and trypanosome infection rates on tsetse.

\noindent
For a location \(s\) at a time \(t\), we thus have:

\[
EIR_{s,t} = ADT_{s, t}\ \times\ IR_{s, t}
\]

(ADT and IR are respectively the apparent density and infection rates).

\noindent
For this study, we will separate the EIR in layers and for each layer one model will be fitted. The rationale for this choice is because the data used are from various sources
and the data on infection rates on tsetse are not available in all the sample available. Therefore, to use all the data at hand, we decided to compute separately
the apparent density and infection rates rather than a single model against the observed EIR.
For the rest of this analysis, the following layers were then considered:
\begin{itemize}
\item Tsetse habitat suitability
\item Tsetse apparent density
\item Trypanosome infection rates in tsetse
\end{itemize}
The first layer, habitat suitability is not part of the mathematical definition of EIR but it is always implied that we measure the risk where the transmission can occur. 
Consequently, we will first analyze the habitat of the main vector of AAT in the study area before estimating and predict EIR where the vectors can survive and transmit AAT.

\subsubsection*{Tsetse habitat suitability}
\label{unnumbered-9}
This is the first layer of the risk index is the habitat suitability. 
We will use this layer to delimit the area at risk where the vector of the disease can survive (the ecological niche).
A statistical analysis of the habitat was carried using correlative species distribution models and 
was thus used to computed the habitat suitability index. 
The methodology used to predict tsetse habitat suitability is based on the framework developed by \cite{dicko2014using} in the Niayes areas (Senegal) using the Maximum Entropy model (MaxEnt).
MaxEnt is one of the most widely used species distribution models. It is a machine learning method based on the information theory concept of maximum entropy \cite{elith2011statistical}.  
MaxEnt fit a species distribution by contrasting the environmental condition where the species is present to the global environment characterized by some generated pseudo-absence data also called background.
The logistic output from MaxEnt is a suitability index that ranges between 0 (less suitable habitat) and 1 (highly suitable habitat). It therefore permit to have a quantitative indicator of the habitat preferences
of tsetse in the study area. During the modeling process, models complexity and tuning were done on the basis of likelihood based information criterion such as corrected Akaike information criterion (AICc) \cite{warren2011ecological}.

\subsubsection*{Tsetse apparent density}
\label{unnumbered-10}
The second layer of the risk index is the dynamic of the population of tsetse flies. 
The predicted number of tsetse flies per month per km\(^{\text{2}}\) were computed. 
This layer was derived using a spatio-temporal regression models based on generalized mixed-models.
A zero-inflated negative binomial model with random effects on the trapping site was fitted against environmental covariates.
Zero-inflated negative binomial model can be seen as extension of the classical poisson regression by using a binomial distribution
to model some potential structural zeros present in the data leaving the remaining zeros as count to be modeled by the poisson distribution.
This model have been used to account for the excess of zeros due to the important number of location with no catch of flies. 
Covariates were chosen according to the literature on tsetse ecology and as shown \cite{rogers1986distribution} by thermal and vegetation related covariates impact the dynamic of the population of tsetse flies through their direct effects on
demographic parameters (birth, mortality, etc.). Because of the sampling bias and clustering of the observations in such entomological data, a random effect on the trapping site was used. 
Furthermore, tsetse apparent densities usually show some seasonality patterns, therefore trigonometric functions were added to the fixed effect regression to control for this effect. 
Finally, model selection and in particular the optimal temporal lag between environmental data and tsetse apparent density 
was performed using likelihood based information criterion.

\subsubsection*{Trypanosome infection rates in tsetse}
\label{unnumbered-11}
The infection rates of tsetse fly represents the third and last layer of our risk index. 
A fly was declared infected if any the major trypanosome strain was detected (T. vivax, T. congolense and T. brucei).
It was also analyzed in the flexible framework of a generalized linear mixed model. 
In particular, the analysis of the infection rates were investigated using a zero-inflated logistic regression with a random effect on the trapping site to account  
for spatial heterogeneity in the data associated with a large number of structural non infection \cite{amek2011spatio, kasasa2013spatio}.
According to \cite{molyneux1980host}, temperature and host availability are the most critical environmental aspect that influences trypanosome
infection on tsetse. Consequently, the model was fitted using th DLST, NLST, cattle and wilds hosts densities as principal covariates and trigonometric functions were
added to account for seasonality in infection rates. 

\subsubsection*{Models validation}
\label{unnumbered-12}
For each layers, standard model quality metrics were used to analyze the accuracy and relevance of each models. 
Discriminative power of the habitat suitability was assessed using classification metrics such as the Area Under the Curve (AUC), Percentage of correctly classified (PCC) and Cohen's Kappa metrics.
Tsetse apparent density and infection rates were validated through residuals analysis, predictive performance on validation data and the use of pseudo-rsquared.

\subsubsection*{Combination of the models}
\label{unnumbered-13}
The combination of the last two layers on suitable habitat is an estimate of the EIR (tsetse challenge) and was used to assess the risk of AAT in Burkina Faso.
All models used in each layer were validated using robusts approaches but in order to have an external validation of the built index,
and assessment of its predictive ability to forecast the prevalence of AAT. Bovine trypanosomosis data were therefore analyzed and in particular
the impact of the EIR on the probability of trypanosome infection by a bovine and EIR impact on herd prevalence has been done.

\section*{Results}
\label{unnumbered-14}
\subsection*{Tsetse habitat suitability}
\label{unnumbered-15}
NDVI related covariates and cumulative Rainfall estimate that describe vegetation and humidity was positively correlated with both the presence
of G. p. gambiensis and G. tachinoides whereas high values of thermal related variables (DLST and NLST) was
characterized with a low suitability index for both species. Figure 2 shows that rivers network are highly suitable with a wider
distribution for G. tachinoides compared to G. p. gambiensis in the study area.
The predictive power of each models was high with an AUC of 0.95 (resp. 0.91) for G. p. gambiensis (resp. G. tachinoides) and
PCC for both species were greater than 80\% (85\% for G. p. gambiensis) (figure 3).
